<a href="https://colab.research.google.com/github/julioreis-dev/tutorial_pandas/blob/main/ipea.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
import pandas as pd
import numpy as np

In [26]:
df_admissao_url = '/content/drive/MyDrive/staging/ipeadata_admissao.csv'
df_demissao_url = '/content/drive/MyDrive/staging/ipeadata_demissao.csv'

In [27]:
df_admissao = pd.read_csv(df_admissao_url, sep=',')
df_demissao = pd.read_csv(df_demissao_url, sep=',')

In [28]:
df_admissao.head()

      Data  ...  Unnamed: 2
0  1999.05  ...         NaN
1  1999.06  ...         NaN
2  1999.07  ...         NaN
3  1999.08  ...         NaN
4  1999.09  ...         NaN

[5 rows x 3 columns]

In [29]:
df_admissao.shape

(248, 3)

In [32]:
df_admissao.columns = ['data', 'admissao', 'descarte']

In [ ]:
df_admissao.drop(columns=['descarte'], inplace=True)

In [39]:
df_admissao.head()

      data  admissao
0  1999.05    732704
1  1999.06    731238
2  1999.07    685905
3  1999.08    690144
4  1999.09    698632

In [42]:
df_admissao.isnull().sum()

data        0
admissao    0
dtype: int64

In [30]:
df_demissao.head()

      Data  ...  Unnamed: 2
0  1999.05  ...         NaN
1  1999.06  ...         NaN
2  1999.07  ...         NaN
3  1999.08  ...         NaN
4  1999.09  ...         NaN

[5 rows x 3 columns]

In [34]:
df_demissao.shape

(247, 3)

In [35]:
df_demissao.columns = ['data', 'demissao', 'descarte']

In [ ]:
df_demissao.drop(columns=['descarte'], inplace=True)

In [40]:
df_demissao.head()

      data  demissao
0  1999.05    635522
1  1999.06    673129
2  1999.07    677848
3  1999.08    676838
4  1999.09    691425

In [41]:
df_demissao.isnull().sum()

data        0
demissao    0
dtype: int64